Tekla Open API Reference for Tekla Structures 2025
PreferredPlacingTypes.InsidePartAlongPartPlacingType Method
 The object is placed using the base line placing. The base line used is in the middle of the part, aligned with the part.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PreferredPlacingTypeBase InsidePartAlongPartPlacingType()
Public Shared Function InsidePartAlongPartPlacingType As PreferredPlacingTypeBase
Return Value
Type: PreferredPlacingTypeBase
A new inside part along part placing type instance.
See Also
Reference
PreferredPlacingTypes Class
Tekla.Structures.Drawing Namespace